Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::VentilationPort Class Referencefinal
MEP Element Manager
The VentilationPort represents a connection point of a duct. More...
#include <MEPVentilationPort.hpp>
 Inheritance diagram for ACAPI::MEP::VentilationPort:
 Classes
class  | Modifier
Modifier of the VentilationPort. More...
 Public Member Functions
double  | GetWallThickness () const
FlowDirection  | GetFlowDirection () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsPhysicallyConnected () const
Result< bool >  | IsPhysicallyConnectable (const UniqueID &portId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< VentilationPort >  | Get (const UniqueID &uniqueId)
Returns a VentilationPort.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl > impl)
Constructs a PortBase with the given port base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The VentilationPort represents a connection point of a duct.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Member Function Documentation
◆ Get()
 static Result< VentilationPort > ACAPI::MEP::VentilationPort::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a VentilationPort.
Parameters
uniqueId | The UniqueID of the requested VentilationPort.
Returns
If the uniqueId belongs to a VentilationPort, returns the object associated to it, otherwise Error.
◆ GetFlowDirection()
 FlowDirection ACAPI::MEP::VentilationPort::GetFlowDirection  |  ( |   | ) |   const
Returns
Returns the flow direction of the VentilationPort.
◆ GetWallThickness()
 double ACAPI::MEP::VentilationPort::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the VentilationPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::VentilationPort::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.